<?php

use Illuminate\Database\Seeder;
use App\Src\Role\Infra\Eloquent\PermissionModel;

class PermissionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $items = $this->getData();
        foreach ($items as $item) {
            $permission_model = PermissionModel::find($item['id']);
            if (!isset($permission_model)) {
                $permission_model = new PermissionModel();
                $permission_model->id = $item['id'];
            }
            $permission_model->name = $item['name'];
            $permission_model->code = $item['code'];
            $permission_model->save();
        }
    }

    private function getData()
    {
        return [
            [
                'id'   => 1,
                'name' => '用户列表',
                'code' => '1001',
            ],
            [
                'id'   => 2,
                'name' => '用户添加',
                'code' => '1002',
            ],
            [
                'id'   => 3,
                'name' => '用户修改',
                'code' => '1003',
            ],
            [
                'id'   => 4,
                'name' => '用户删除',
                'code' => '1004',
            ],
            [
                'id'   => 5,
                'name' => '角色列表',
                'code' => '1005',
            ],
            [
                'id'   => 6,
                'name' => '角色添加',
                'code' => '1006',
            ],
            [
                'id'   => 7,
                'name' => '角色修改',
                'code' => '1007',
            ],
            [
                'id'   => 8,
                'name' => '角色删除',
                'code' => '1008',
            ],
            [
                'id'   => 9,
                'name' => '产品分类列表',
                'code' => '1009',
            ], [
                'id'   => 10,
                'name' => '产品分类增加',
                'code' => '1010',
            ], [
                'id'   => 11,
                'name' => '产品分类删除',
                'code' => '1011',
            ], [
                'id'   => 12,
                'name' => '产品分类修改',
                'code' => '1012',
            ], [
                'id'   => 13,
                'name' => '广告列表',
                'code' => '1013',
            ], [
                'id'   => 14,
                'name' => '广告增加',
                'code' => '1014',
            ], [
                'id'   => 15,
                'name' => '广告删除',
                'code' => '1015',
            ], [
                'id'   => 16,
                'name' => '广告修改',
                'code' => '1016',
            ], [
                'id'   => 17,
                'name' => '用户消息列表',
                'code' => '1017',
            ], [
                'id'   => 18,
                'name' => '用户消息增加',
                'code' => '1018',
            ], [
                'id'   => 19,
                'name' => '用户消息删除',
                'code' => '1019',
            ], [
                'id'   => 20,
                'name' => '用户消息修改',
                'code' => '1020',
            ], [
                'id'   => 21,
                'name' => '广播消息列表',
                'code' => '1021',
            ], [
                'id'   => 22,
                'name' => '广播消息增加',
                'code' => '1022',
            ], [
                'id'   => 23,
                'name' => '广播消息删除',
                'code' => '1023',
            ], [
                'id'   => 24,
                'name' => '广播消息修改',
                'code' => '1024',
            ], [
                'id'   => 25,
                'name' => '区域列表',
                'code' => '1025',
            ], [
                'id'   => 26,
                'name' => '区域增加',
                'code' => '1026',
            ], [
                'id'   => 27,
                'name' => '区域删除',
                'code' => '1027',
            ], [
                'id'   => 28,
                'name' => '区域修改',
                'code' => '1028',
            ], [
                'id'   => 29,
                'name' => '省份列表',
                'code' => '1029',
            ], [
                'id'   => 30,
                'name' => '省份增加',
                'code' => '1030',
            ], [
                'id'   => 31,
                'name' => '省份删除',
                'code' => '1031',
            ], [
                'id'   => 32,
                'name' => '省份修改',
                'code' => '1032',
            ], [
                'id'   => 33,
                'name' => '城市列表',
                'code' => '1033',
            ], [
                'id'   => 34,
                'name' => '城市增加',
                'code' => '1034',
            ], [
                'id'   => 35,
                'name' => '城市删除',
                'code' => '1035',
            ], [
                'id'   => 36,
                'name' => '城市修改',
                'code' => '1036',
            ], [
                'id'   => 37,
                'name' => '品类列表',
                'code' => '1037',
            ], [
                'id'   => 38,
                'name' => '品类增加',
                'code' => '1038',
            ], [
                'id'   => 39,
                'name' => '品类删除',
                'code' => '1039',
            ], [
                'id'   => 40,
                'name' => '品类修改',
                'code' => '1040',
            ], [
                'id'   => 41,
                'name' => '属性列表',
                'code' => '1041',
            ], [
                'id'   => 42,
                'name' => '属性增加',
                'code' => '1042',
            ], [
                'id'   => 43,
                'name' => '属性删除',
                'code' => '1043',
            ], [
                'id'   => 44,
                'name' => '属性修改',
                'code' => '1044',
            ], [
                'id'   => 45,
                'name' => '客户账号列表',
                'code' => '1045',
            ], [
                'id'   => 46,
                'name' => '客户账号增加',
                'code' => '1046',
            ], [
                'id'   => 47,
                'name' => '客户账号删除',
                'code' => '1047',
            ], [
                'id'   => 48,
                'name' => '客户账号修改',
                'code' => '1048',
            ], [
                'id'   => 49,
                'name' => '客户反馈列表',
                'code' => '1049',
            ], [
                'id'   => 50,
                'name' => '客户反馈增加',
                'code' => '1050',
            ], [
                'id'   => 51,
                'name' => '客户反馈删除',
                'code' => '1051',
            ], [
                'id'   => 52,
                'name' => '客户反馈修改',
                'code' => '1052',
            ], [
                'id'   => 53,
                'name' => '供应商列表',
                'code' => '1053',
            ], [
                'id'   => 54,
                'name' => '供应商增加',
                'code' => '1054',
            ], [
                'id'   => 55,
                'name' => '供应商删除',
                'code' => '1055',
            ], [
                'id'   => 56,
                'name' => '供应商修改',
                'code' => '1056',
            ], [
                'id'   => 57,
                'name' => '供应商排名列表',
                'code' => '1057',
            ], [
                'id'   => 58,
                'name' => '供应商排名增加',
                'code' => '1058',
            ], [
                'id'   => 59,
                'name' => '供应商排名删除',
                'code' => '1059',
            ], [
                'id'   => 60,
                'name' => '供应商排名修改',
                'code' => '1060',
            ], [
                'id'   => 61,
                'name' => '开发商列表',
                'code' => '1061',
            ], [
                'id'   => 62,
                'name' => '开发商增加',
                'code' => '1062',
            ], [
                'id'   => 63,
                'name' => '开发商删除',
                'code' => '1063',
            ], [
                'id'   => 64,
                'name' => '开发商修改',
                'code' => '1064',
            ], [
                'id'   => 65,
                'name' => '楼盘列表',
                'code' => '1065',
            ], [
                'id'   => 66,
                'name' => '楼盘增加',
                'code' => '1066',
            ], [
                'id'   => 67,
                'name' => '楼盘删除',
                'code' => '1067',
            ], [
                'id'   => 68,
                'name' => '楼盘修改',
                'code' => '1068',
            ], [
                'id'   => 69,
                'name' => '企业证书审核列表',
                'code' => '1069',
            ], [
                'id'   => 70,
                'name' => '企业证书审核增加',
                'code' => '1070',
            ], [
                'id'   => 71,
                'name' => '企业证书审核删除',
                'code' => '1071',
            ], [
                'id'   => 72,
                'name' => '企业证书审核修改',
                'code' => '1072',
            ], [
                'id'   => 73,
                'name' => '服务网点审核列表',
                'code' => '1073',
            ], [
                'id'   => 74,
                'name' => '服务网点审核增加',
                'code' => '1074',
            ], [
                'id'   => 75,
                'name' => '服务网点审核删除',
                'code' => '1075',
            ], [
                'id'   => 76,
                'name' => '服务网点审核修改',
                'code' => '1076',
            ], [
                'id'   => 77,
                'name' => '战略合作审核列表',
                'code' => '1077',
            ], [
                'id'   => 78,
                'name' => '战略合作审核增加',
                'code' => '1078',
            ], [
                'id'   => 79,
                'name' => '战略合作审核删除',
                'code' => '1079',
            ], [
                'id'   => 80,
                'name' => '战略合作审核修改',
                'code' => '1080',
            ], [
                'id'   => 81,
                'name' => '宣传图片审核列表',
                'code' => '1081',
            ], [
                'id'   => 82,
                'name' => '宣传图片审核增加',
                'code' => '1082',
            ], [
                'id'   => 83,
                'name' => '宣传图片审核删除',
                'code' => '1083',
            ], [
                'id'   => 84,
                'name' => '宣传图片审核修改',
                'code' => '1084',
            ], [
                'id'   => 85,
                'name' => '历史项目审核列表',
                'code' => '1085',
            ], [
                'id'   => 86,
                'name' => '历史项目审核增加',
                'code' => '1086',
            ], [
                'id'   => 87,
                'name' => '历史项目审核删除',
                'code' => '1087',
            ], [
                'id'   => 88,
                'name' => '历史项目审核修改',
                'code' => '1088',
            ], [
                'id'   => 89,
                'name' => '企业动态审核列表',
                'code' => '1089',
            ], [
                'id'   => 90,
                'name' => '企业动态审核增加',
                'code' => '1090',
            ], [
                'id'   => 91,
                'name' => '企业动态审核删除',
                'code' => '1091',
            ], [
                'id'   => 92,
                'name' => '企业动态审核修改',
                'code' => '1092',
            ], [
                'id'   => 93,
                'name' => '产品方案审核列表',
                'code' => '1093',
            ], [
                'id'   => 94,
                'name' => '产品方案审核增加',
                'code' => '1094',
            ], [
                'id'   => 95,
                'name' => '产品方案审核删除',
                'code' => '1095',
            ], [
                'id'   => 96,
                'name' => '产品方案审核修改',
                'code' => '1096',
            ], [
                'id'   => 97,
                'name' => '方案审核列表',
                'code' => '1097',
            ], [
                'id'   => 98,
                'name' => '方案审核增加',
                'code' => '1098',
            ], [
                'id'   => 99,
                'name' => '方案审核删除',
                'code' => '1099',
            ], [
                'id'   => 100,
                'name' => '方案审核修改',
                'code' => '1100',
            ], [
                'id'   => 101,
                'name' => '内容分类列表',
                'code' => '1101',
            ], [
                'id'   => 102,
                'name' => '内容分类增加',
                'code' => '1102',
            ], [
                'id'   => 103,
                'name' => '内容分类删除',
                'code' => '1103',
            ], [
                'id'   => 104,
                'name' => '内容分类修改',
                'code' => '1104',
            ], [
                'id'   => 105,
                'name' => '内容列表',
                'code' => '1105',
            ], [
                'id'   => 106,
                'name' => '内容增加',
                'code' => '1106',
            ], [
                'id'   => 107,
                'name' => '内容删除',
                'code' => '1107',
            ], [
                'id'   => 108,
                'name' => '内容修改',
                'code' => '1108',
            ], [
                'id'   => 109,
                'name' => '合作机构媒体列表',
                'code' => '1109',
            ], [
                'id'   => 110,
                'name' => '合作机构媒体增加',
                'code' => '1110',
            ], [
                'id'   => 111,
                'name' => '合作机构媒体删除',
                'code' => '1111',
            ], [
                'id'   => 112,
                'name' => '合作机构媒体修改',
                'code' => '1112',
            ],


        ];
    }
}
